nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
   //------------------------------------------------------------------------------------------------------------------- 
	if (strncmp((char*)GSM_rx, "AT-Command Interpreter ready",20) == 0)  
	{	
		 /*
				 模块重新启动了，有些状态要还原到相应状态 ，-- 需要做处理
		  */ 
		GSM_PWR.GSM_PowerEnable=0;      
		GSM_PWR.GSM_powerCounter=0;
		GSM_PWR.GSM_power_over=1;   
		rt_kprintf("\r\n  GSM 模块启动\r\n");         			
	}

   #ifdef REC_VOICE_ENABLE
	 if(strncmp((char*)GSM_rx,"%RECFGET: ",9)==0)  //%RECFGET: 6624,"0E360C764009
      	{
      	   //   rt_kprintf("\r\n  RECFGET len=%d\r\n",len);
      	      memcpy(VocREC.ASCII_in,GSM_rx,len);  
             VOC_REC_dataGet(VocREC.ASCII_in);    
	      goto RXOVER; 	 		
      	} 
   #endif 
  /*     if(strncmp((char*)GSM_rx, "%IPDATA:2",9)==0)   // ISP 过来      
	{												   //exam:	%IPDATA:2,16,"6473616466617365"
              for(i=0;i<20;i++)   //  从前20个字节中找第一个"
		{
			if(GSM_rx[i]=='"')
				break;
		} 
		  info_len=(len-i-5);	 
		    rt_kprintf("\r\n infolen=%d  len=%d  i=%d\r\n",info_len,len,i);      
	        // Get_GSM_HexData(GSM_rx+i+1,info_len,1);      //  远程下载链路
	        //------------------------------------------------
	         UDP_hexRx_len= GSM_AsciitoHEX_Convert(GSM_rx+i+1,info_len,UDP_HEX_Rx); 
	         TCP_RX_Process(1);    
		//--------------------------------------------------	 
	         goto RXOVER; 
	 }	
	else*/    
	if(strncmp((char*)GSM_rx, "%IPDATA:1",9)==0) // UDP	  有数据过来了
	{												   //exam:	%IPDATA:1,16,"6473616466617365"
               for(i=0;i<20;i++)   //  从前20个字节中找第一个"
			{
				if(GSM_rx[i]=='"')
					break;
			} 
		  info_len=len-i-5;  	  
		
		//sscanf(GSM_rx+10, "%d", (u32*)&info_len); 	
		//info_len=(info_len<<1);
	   // rt_kprintf("\r\n rxlen=%d,caculen=%d \r\n",info_len,len-i-5);    
		WatchDog_Feed();
	    Get_GSM_HexData(GSM_rx+i+1,info_len,0);         
	         goto RXOVER; 	 
	 } 
	
	#ifdef  REC_VOICE_ENABLE
		if(strncmp((char*)GSM_rx,"%RECSTOP:",9)==0)  //%RECSTOP: 10,6824
		{
	             VOC_REC_getinfolen(GSM_rx);  
		         goto RXOVER; 	 		 
		}
	#endif
	
	if(strncmp((char*)GSM_rx, "%TTS: 0",7)==0)
	{
                 TTS_Play_End();
		    rt_kprintf("\r\n   TTS  播放完毕\r\n");   
			Speak_OFF;
	}
#ifdef  SMS_ENABLE
	//--------      SMS  service  related Start  -------------------------------------------
	//+CMTI: "SM",1            +CMTI: "SM",1
	if( strncmp( (char*)GSM_rx, "+CMTI: \"SM\",", 12 ) == 0 )
	{
		rt_kprintf( "\r\n收到短信:" );
		j = sscanf( GSM_rx + 12, "%d", &i );
		if( j )
		{
			SMS_Rx_Notice(i);	
		}
	}
	else if( strncmp( (char*)GSM_rx, "+CMT: ", 6 ) == 0 )
	{
		if(GSM_rx[6]==',')		///PDU模式
		{
			if( RT_EOK == rt_mq_recv( &mq_GSM, (void*)&GSM_RX_BUFF, GSM_TYPEBUF_SIZE, RT_TICK_PER_SECOND ) )    //等待1000ms,实际上就是变长的延时,最长1000ms
			{
				memset( GSM_rx, 0, sizeof( GSM_rx ) );
				memcpy( GSM_rx, GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr );
				len=GSM_RX_BUFF.gsm_wr;

				SMS_Rx_PDU(GSM_rx,len); 
			}
		}
		else					///TEXT模式
		{
			j	= 0;
			q	= 0;
			memset( reg_str, 0, sizeof( reg_str ) );
			for( i = 6; i < len; i++ )
			{
				if( ( j == 1 ) && ( GSM_rx[i] != '"' ) )
				{
					reg_str[q++] = GSM_rx[i];
				}
				if( GSM_rx[i] == '"' )
				{
					j++;
					if(j>1)
						break;
				}
			}
			//rt_kprintf( "\r\n  短息来源号码:%s \r\n", reg_str );
			if( RT_EOK == rt_mq_recv( &mq_GSM, (void*)&GSM_RX_BUFF, GSM_TYPEBUF_SIZE, RT_TICK_PER_SECOND ) )    //等待1000ms,实际上就是变长的延时,最长1000ms
			{
				memset( GSM_rx, 0, sizeof( GSM_rx ) );
				memcpy( GSM_rx, GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr );
				len=GSM_RX_BUFF.gsm_wr;
				SMS_Rx_Text(GSM_rx,reg_str);
			}
		}
		
	}
#ifdef SMS_TYPE_PDU
	else if( strncmp( (char*)GSM_rx, "+CMGR:", 6 ) == 0 )
	{
		if( RT_EOK == rt_mq_recv( &mq_GSM, (void*)&GSM_RX_BUFF, GSM_TYPEBUF_SIZE, RT_TICK_PER_SECOND ) )    //等待1000ms,实际上就是变长的延时,最长1000ms
		{
			memset( GSM_rx, 0, sizeof( GSM_rx ) );
			memcpy( GSM_rx, GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr );
			len=GSM_RX_BUFF.gsm_wr;

			SMS_Rx_PDU(GSM_rx,len);
		}
	}
#else
	else if( strncmp( (char*)GSM_rx, "+CMGR:", 6 ) == 0 )
	{
		//+CMGR: "REC UNREAD","8613602069191", ,"13/05/16,13:05:29+35"
		// 获取要返回短息的目的号码
		j	= 0;
		q	= 0;
		memset( reg_str, 0, sizeof( reg_str ) );
		for( i = 6; i < 50; i++ )
		{
			if( ( j == 3 ) && ( GSM_rx[i] != '"' ) )
			{
				reg_str[q++] = GSM_rx[i];
			}
			if( GSM_rx[i] == '"' )
			{
				j++;
			}
		}
		//rt_kprintf( "\r\n  短息来源号码:%s \r\n", reg_str );
		if( RT_EOK == rt_mq_recv( &mq_GSM, (void*)&GSM_RX_BUFF, GSM_TYPEBUF_SIZE, RT_TICK_PER_SECOND ) )    //等待1000ms,实际上就是变长的延时,最长1000ms
		{
			memset( GSM_rx, 0, sizeof( GSM_rx ) );
			memcpy( GSM_rx, GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr );
			len=GSM_RX_BUFF.gsm_wr;
			SMS_Rx_Text(GSM_rx,reg_str);			
		}
	}
#endif

#endif
	if(strncmp((char*)GSM_rx, "%IPSENDX:1",10)==0)	 // 链路 1  TCP 发送OK  
	{												   //exam:	%IPSENDX:1,15 
                //Api_cycle_Update();  //  数据发送 ，更新写指针	   
                if(Send_Rdy4ok==1)
		   	{
		   	    Api_cycle_Update();
			    Send_Rdy4ok=0;	   
		   	}
		  WatchDog_Feed();             		
	} 
	else
       if(strncmp((char*)GSM_rx, "%IPCLOSE: 2",11) == 0)// ISP close
	 {
		
		rt_kprintf("\r\n");
		rt_kprintf("%s",GSM_rx); 
		rt_kprintf("\r\n");
           #ifdef MULTI_LINK
		     TCP2_Connect=0;										   
		     TCP2_ready_dial=0;  
		     TCP2_login=0;  

              
		     if(DataLink_Status())
			 	  TCP2_ready_dial=1;         
		 #endif	 
        } 
	else
	if(strncmp((char*)GSM_rx, "IPCLOSE",5) == 0)    
	{
		 DataLink_Online=0;
		 ModuleStatus &=~Status_GPRS;
		 rt_kprintf("\r\n所有链接都关闭!\r\n");  
		 DataDial.Pre_Dial_flag=1;
		 //------  交互导航链接状态 ----------
		// ZHinfotype=ZH_01H;
		// subtype=0x2B;	  //  通知显示屏断开   
		 
	}
	else
	if(strncmp((char*)GSM_rx, "%IPCLOSE:",9) == 0)	  
	{
	   DataLink_Online=0;
		 ModuleStatus &=~Status_GPRS; 
		 rt_kprintf("\r\nTCP连接关闭!\r\n");	 
		 if(CallState==CallState_Idle)		 //  不要再通话的时候操作 
		 {	
		    rt_hw_gsm_output("ATH\r\n"); 		
			DataLink_EndFlag=1; 
			DEV_Login.Operate_enable=1;//重新鉴权
		 }
		 
