nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
	}	
      if(strncmp((char*)GSM_rx, "%DNSR:",6) == 0)
	{  //%DNSR:113.31.28.100
		//%DNSR:0.0.0.0 
		if(strncmp((char*)GSM_rx, "%DNSR:0.0.0.0",13) == 0)
		  {
		        rt_kprintf("\r\n   域名解析失败\r\n");    
			 if((Dial_jump_State==7)||(Dial_jump_State==8))
				Dial_jump_State=0;    
		        Dnsr_state=0;//表示DNSR 状态下拨号 			  

		  }	  
	        else
	        { 
	                     
	                    
				i =str2ip((char*)GSM_rx+6, RemoteIP_Dnsr);
				if (i <= 3) failed = true; 
			        //memcpy((char*)SysConf_struct.IP_Main,RemoteIP_main,4);
				 // SysConf_struct.Port_main=RemotePort_main;
				 //Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
			        DataLink_MainSocket_set(RemoteIP_Dnsr,RemotePort_main,1);
                             rt_kprintf("\r\n   域名解析成功\r\n"); 

				  Dial_Stage(Dial_MainLnk);  //--   切换到拨号    
				  return ;
		}
      	}
	else
	if(strncmp((char*)GSM_rx, "+COPS: 0,0,",11)==0)
	{ 
			//联通卡	   +COPS: 0,0,"CHN-CUGSM"
			//移动卡	   +COPS: 0,0,"CHINA  MOBILE"
			//注销的卡	  +COPS: 0
	  	if(strncmp((char*)GSM_rx+12, "CHINA UNICOM",12)==0)
	  	    {
			memcpy(APN_String,"UNINET",6);
            memset((u8*)SysConf_struct.APN_str,0 ,sizeof(SysConf_struct.APN_str));
            memcpy(SysConf_struct.APN_str,(u8*)APN_String,strlen((const char*)APN_String));  
            Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));       
				
			//联通的
			memset((char *)Dialinit_APN,0,sizeof(Dialinit_APN));
			strcat((char*)Dialinit_APN, "AT+CGDCONT=1,\"IP\",\"UNINET\"\r\n");  
			}
		else if(strncmp((char*)GSM_rx+12, "CHINA MOBILE",12)==0)	
			{
			memcpy(APN_String,"CMNET",5);
            memset((u8*)SysConf_struct.APN_str,0 ,sizeof(SysConf_struct.APN_str));
            memcpy(SysConf_struct.APN_str,(u8*)APN_String,strlen((const char*)APN_String));  
            Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));       
			
		   // 移动的
			memset(Dialinit_APN,0,sizeof(Dialinit_APN));
			strcat(Dialinit_APN, "AT+CGDCONT=1,\"IP\",\"CMNET\"\r\n");
			}
		   CommAT.Initial_step++; 
		 //-------------------------------------------------------------------------   
		   
			
	}  
	else
	if(strncmp((char*)GSM_rx, "+COPS: 0",8)==0)  //----该卡被注销了
	{
		COPS_Couter++;
		if(COPS_Couter>=3) 
		{
			COPS_Couter=0;
			CommAT.Initial_step++;   
			rt_kprintf("\r\n  SIM卡搜索不到网络\r\n"); 
		}
	}
	else
	if(strncmp((char*)GSM_rx, "OK",2) == 0)  
		{				
		    ok = true;
		  if(DispContent)	
			   rt_kprintf(" OK\r\n");     			
			//-------------------------------------------
		#ifdef REC_VOICE_ENABLE	
		  VOC_REC_filedel();	 
		#endif
		  //   Online  state  OK  ,clear Error Counter
                  if(DataLink_Status())       
	          {
	                Online_error_counter=0; // clear 
                 }
	        		
        }
	else
	if (strcmp((char*)GSM_rx, "NO DIALTONE") == 0) failed = true;
	else
	if (strcmp((char*)GSM_rx, "NO ANSWER") == 0) failed = true;
	if (strncmp((char*)GSM_rx, "NO CARRIER",10) == 0) 
	{                      //  NO CARRIER  
		 CallState=CallState_Idle;	
		  Speak_OFF;// 关闭功放 
		 failed = true;
		 rt_kprintf("\r\n Callstate=Idle\r\n");    
	}   
	if(strcmp((char*)GSM_rx, "BUSY") == 0)  
	{ 
		// ZHinfotype=ZH_01H;//  车台向终端发送振铃指示
		 //subtype=0x12;	   //挂断
		 CallState=CallState_Idle;	
		 failed = true; 
		// Off_speaker;		// 关闭功放 
		 //Clip_flag=0;
		 //Clip_counter=0; 
	
	}
	else
	if(strncmp((char*)GSM_rx,"+CSQ:",5)==0)	//场强信息
	{ //+CSQ: 27,99
				if ( GSM_rx[7] == ',' )
				{
						ModuleSQ = GSM_rx[6] - 0x30;   
				}
				else if ( GSM_rx[8] == ',' )
				{
						ModuleSQ = ( GSM_rx[6] - 0x30 ) * 10 + GSM_rx[7] - 0x30;
	
						if ( ModuleSQ == 99 )
						{
								ModuleSQ = 0;
						}
				}
	          //-------------------------------------- 
	 	      //  You must   register on 
	 		  if(CommAT.Total_initial==1)
	 			{
	                 if((ModuleSQ>10)&&(CommAT.Initial_step==18))    
	 				{
	 				  CommAT.Initial_step++;
					  rt_kprintf("\r\n CSQ check Pass\r\n");     
	                }
	 			} 				 
		
	}

	if (strncmp((char*)GSM_rx, "%TSIM",5) == 0)	 //-----  %TSIM 1 %TSIM 1
	{
	   if(GSM_rx[6]=='0')
		{
				  IMSIGet.imsi_error_count++;
				  if(IMSIGet.imsi_error_count>10) 
					{
					  IMSIGet.Get_state=2;
					  IMSIGet.imsi_error_count=0; 
					  GSM_PWR.GSM_power_over=0;;
					  IMSIGet.Get_state=0;
					 // EM310_StartFLAG=0;
					  rt_kprintf("\r\n没有检测到SIM卡\r\n"); 
					}	
		}
	   else
	   if(GSM_rx[6]=='1') 
		{
			IMSIGet.Get_state=1;
			rt_kprintf("\r\n  检测到SIM卡\r\n"); 
		}
	}	  
	else
	if (strncmp((char*)GSM_rx, "460",3) == 0)	//----- Nathan Add
	{
	  
	  CommAT.Total_initial=1;	// 进行参数配置
	  //---  add for Test  ----- 
	// memcpy(GSM_rx,"460021022612645",15);     // 河北平台车123         
	 //   memcpy(GSM_rx,"460013602069192",15);     // 河北平台车123       
	  //memcpy(GSM_rx,"460012212469640",15);     // 渝000000-lnw
	  //memcpy(GSM_rx,"460011031643452",15);     // 江工车台
	  rt_kprintf("\r\n获取IMSI 号码:%s \r\n",GSM_rx);       
	  memcpy((char*)IMSI_CODE,(char*)GSM_rx,15);
	  RTC_TimeShow();
	  IMSIGet.imsi_error_count=0;	
	  IMSIGet.Get_state=1;
	  GSM_PWR.GSM_power_over=2;     //  get imsi
	  IMSIGet.Get_state=0;
	  CommAT.Total_initial=1;	// 进行参数配置  	  	 
	}
	if (strncmp((char*)GSM_rx, "+CCID: \"",8) == 0) 
       {  //+CCID: "89860109520220884603"    AT+CCID
           //  获取终端属性  ，ICCID 字段
           ok=0;// 借用做下标
           for(i=0;i<10;i++)
           {
              ProductAttribute._5_Sim_ICCID[ok]=((GSM_rx[8+2*i]-0x30)<<4)+(GSM_rx[9+2*i]-0x30);
              ok++;
           }		  
	}
	else
	if(strncmp((char*)GSM_rx,"RING",4)==0)  //电话  RING
	{
	    if((JT808Conf_struct.Auto_ATA_flag==1)&&(Calling_ATA_flag==0))
	    { 
	      
            Ring_counter++;	
			if(Ring_counter>=3)
				{
                   Calling_ATA_flag=1;
                   Ring_counter=0;
				}
	    }
	}  
	else
	if ((strlen((char*)GSM_rx) >= 7) && (strncmp((char*)GSM_rx, "CONNECT", 7) == 0))
	{
	      connect=true;
	}
	if(strncmp((char*)GSM_rx,"ERROR: 13",9)==0)//ERROR:13
	{
	      Online_error_counter++;
		  if(Online_error_counter>3)	 
	         {   
	                rt_kprintf("\r\n  error 13  >3  disc\r\n");
	                DataLink_EndFlag=1; //AT_End();    
	                            Online_error_counter=0;
		  }

